local MainStorage = game:GetService('MainStorage')
local gg                = require(MainStorage.code.common.MGlobal)    ---@type gg
local Modifiers = require(MainStorage.code.common.config_type.modifier.Modifiers) ---@type Modifiers
    
---@class LevelConfig
local LevelConfig = {}
local loaded = false

local function LoadConfig()
    local LevelType = require(MainStorage.code.common.config_type.LevelType) ---@type LevelType
    LevelConfig.config ={
    ["新手关"] = LevelType.New({
        ["关卡ID"] = "新手关",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 1,
                        ["最大数量"] = 1,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"不好！僵尸入侵了你的房子","可点击任意位置":true},{"UI名":"BattleHud","控件路径":"开火","提示文本":"点击这里，向僵尸开炮！","可点击任意位置":true,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"点击鼠标左键，向僵尸开炮！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 3,
                        ["最大数量"] = 3,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"开火","提示文本":"按住拖动，可以扫射开火！","可点击任意位置":false,"若是PC端则改为":{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"移动鼠标，可以瞄准僵尸","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "呆滞僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 1,
                        ["数量"] = 6,
                        ["最大数量"] = 6,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true,"若是PC端则改为":{"UI名":"HudCards","控件路径":"副卡列表/卡片_1","提示文本":"按下数字[1】键\\n丢出樱桃炸弹\\n炸飞一大波僵尸！","可点击任意位置":true}}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 100,
                        ["最大数量"] = 100,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["开始时执行指令"] = {
                    [[focusOn {"聚焦UI":{"聚焦UI":[{"UI名":"BattleHud","控件路径":"UIImage","提示文本":"很好！现在击败剩下的僵尸吧","可点击任意位置":true}],"完成时执行指令":[]}} ]]
                },
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "新手关",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 1,
        ["每个玩家增加数量倍率"] = 0,
        ["临时装备技能"] = {
            {
                ["技能类型"] = "火焰豌豆",
                ["等级"] = 1,
                ["装备槽位"] = 1
            },
            {
                ["技能类型"] = "副-樱桃炸弹",
                ["等级"] = 1,
                ["装备槽位"] = 2
            },
            {
                ["技能类型"] = "副-星星果",
                ["等级"] = 1,
                ["装备槽位"] = 3
            },
            {
                ["技能类型"] = "副-椰子炮",
                ["等级"] = 1,
                ["装备槽位"] = 4
            }
        },
        ["关闭结算界面"] = true
    }),
    ["1-1（1~500级）"] = LevelType.New({
        ["关卡ID"] = "1-1（1~500级）",
        ["描述"] = "需求等级: [level]/1级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 5,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1,
                    6
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/awooga_僵尸来袭.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 5,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    7,
                    20
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 80
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 5,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    21,
                    50
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 5,
                        ["最大数量"] = 8,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    51,
                    100
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 50,
                        ["数量"] = 10,
                        ["最大数量"] = 25,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    101,
                    200
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 50,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    150,
                    250
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    250,
                    300
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 30,
                        ["数量"] = 3,
                        ["最大数量"] = 7,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    300,
                    400
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "40",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 30
                    }
                },
                ["转波次文字"] = "AssetId://391536769349332993",
                ["转波次音效"] = "sandboxId://soundeffect/finalwave_终波.ogg"
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 1,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 64800,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 910,
                    ["金币"] = 3
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 455,
                    ["金币"] = 2
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 260,
                    ["金币"] = 1
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 130
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 52
                }
            }
        },
        ["关闭结算界面"] = false,
        ["胜利音效"] = "sandboxId://soundeffect/winmusic胜利音效.ogg",
        ["失败音效"] = "sandboxId://soundeffect/brain_eaten.ogg"
    }),
    ["1-2（500~5000级）"] = LevelType.New({
        ["关卡ID"] = "1-2（500~5000级）",
        ["描述"] = "需求等级: [level]/100级",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    500,
                    600
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 50
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 10
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    650,
                    800
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 15,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    800,
                    1100
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1100,
                    1500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 20
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    1500,
                    2000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 40
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2000,
                    2600
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 25,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    2600,
                    3500
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "8",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    3600,
                    4000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "2",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    4000,
                    4600
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "5",
                        ["几率"] = 40
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.01
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 5,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "StatCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 72000,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 1820,
                    ["金币"] = 20
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 1040,
                    ["金币"] = 10
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 520,
                    ["金币"] = 5
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 260,
                    ["金币"] = 4
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 65,
                    ["金币"] = 10
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["1-3（5000级~20000级）"] = LevelType.New({
        ["关卡ID"] = "1-3（5000级~20000级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    5000,
                    6000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    6000,
                    7000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    7000,
                    9000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    9000,
                    12000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "3",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 35,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    12000,
                    15000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "10",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 15,
                        ["最大数量"] = 25,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    15000,
                    18000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    18000,
                    20000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 3,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 2340,
                    ["金币"] = 80
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 2000,
                    ["金币"] = 60
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 1600,
                    ["金币"] = 15
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 1000,
                    ["金币"] = 7
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 560,
                    ["金币"] = 6
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["1-4（20000级~30000级）"] = LevelType.New({
        ["关卡ID"] = "1-4（20000级~30000级）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    20000,
                    21000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 50
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 40
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    21000,
                    22000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "20",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    22000,
                    23000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.02
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "士兵僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    23000,
                    24000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "10",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.03
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    24000,
                    26000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "70",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "15",
                        ["几率"] = 0.04
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "寒冰僵尸",
                                ["比重"] = 100
                            },
                            {
                                ["怪物类型"] = "摇滚僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    26000,
                    28000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.05
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 30,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    28000,
                    29000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "60",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "15",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "5",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 60,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    29000,
                    30000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "30",
                        ["几率"] = 60
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 4,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 14400,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 28800,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 43200,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            },
            {
                ["目标"] = "自己",
                ["条件类型"] = "VariableCondition",
                ["条件"] = {
                    ["名字"] = "online_time",
                    ["最小值"] = 57600,
                    ["最大值"] = 86400
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 2880,
                    ["金币"] = 192
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 2640,
                    ["金币"] = 168
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 2280,
                    ["金币"] = 144
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 1920,
                    ["金币"] = 120
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 1560,
                    ["金币"] = 96
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["1-5（30000级+）"] = LevelType.New({
        ["关卡ID"] = "1-5（30000级+）",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    30000,
                    31000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "80",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 50
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 40,
                        ["开始时间"] = 0
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    31000,
                    32000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 55
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 55
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    32000,
                    33000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.05
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    33000,
                    34000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    34000,
                    35000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    35000,
                    36000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    36000,
                    37000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    37000,
                    38000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 50,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    38000,
                    39000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = "绅士僵尸",
                                ["比重"] = 100
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 20,
                        ["最大数量"] = 60,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    39000,
                    40000
                },
                ["掉落物"] = {
                    {
                        ["物品"] = "阳光",
                        ["数量"] = "90",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "金币",
                        ["数量"] = "6",
                        ["几率"] = 60
                    },
                    {
                        ["物品"] = "能量豆",
                        ["数量"] = "1",
                        ["几率"] = 0.06
                    }
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本2",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 5,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0,
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["掉落物数量修改"] = {
            {
                ["目标"] = "自己",
                ["条件类型"] = "WorldTimeCondition",
                ["条件"] = {
                    ["最小值"] = 6,
                    ["最大值"] = 18
                },
                ["反转"] = true,
                ["动作"] = "威力乘以",
                ["数量"] = "0.5"
            }
        },
        ["排名掉落物"] = {
            {
                ["名次"] = {
                    1,
                    1
                },
                ["物品"] = {
                    ["阳光"] = 4800,
                    ["金币"] = 300
                }
            },
            {
                ["名次"] = {
                    2,
                    2
                },
                ["物品"] = {
                    ["阳光"] = 3900,
                    ["金币"] = 250
                }
            },
            {
                ["名次"] = {
                    3,
                    3
                },
                ["物品"] = {
                    ["阳光"] = 3300,
                    ["金币"] = 200
                }
            },
            {
                ["名次"] = {
                    4,
                    5
                },
                ["物品"] = {
                    ["阳光"] = 2800,
                    ["金币"] = 160
                }
            },
            {
                ["名次"] = {
                    6,
                    7
                },
                ["物品"] = {
                    ["阳光"] = 2400,
                    ["金币"] = 140
                }
            }
        },
        ["关闭结算界面"] = false
    }),
    ["测试关卡"] = LevelType.New({
        ["关卡ID"] = "测试关卡",
        ["前置关卡"] = nil,
        ["关卡波次"] = {
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            },
            {
                ["刷新波次"] = {
                    {
                        ["刷新怪物"] = {
                            {
                                ["怪物类型"] = nil,
                                ["比重"] = 50
                            }
                        },
                        ["持续时间"] = 20,
                        ["数量"] = 10,
                        ["最大数量"] = 20,
                        ["开始时间"] = 10
                    }
                },
                ["属性倍率"] = 1,
                ["怪物等级"] = {
                    0,
                    0
                },
                ["转波次文字"] = "",
                ["转波次音效"] = ""
            }
        },
        ["场景"] = "副本1",
        ["开始玩家"] = 1,
        ["增加额外玩家时间"] = 10,
        ["最大玩家数"] = 6,
        ["每个玩家增加数量倍率"] = 0.5,
        ["每个玩家增加属性倍率"] = {
            ["生命"] = 0.5,
            ["攻击"] = 0.1
        },
        ["进入条件"] = Modifiers.New({
            {
                ["目标"] = "自己",
                ["条件类型"] = "HealthCondition",
                ["条件"] = {
                    ["百分比"] = true,
                    ["最小值"] = 0,
                    ["最大值"] = 100
                },
                ["动作"] = "必须"
            }
        }),
        ["关闭结算界面"] = false
    })
}loaded = true
end

---@param level string
---@return LevelType
function LevelConfig.Get(level)
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config[level]
end

---@return table<string, LevelType>
function LevelConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return LevelConfig.config
end
return LevelConfig