-- PlayerInitConfig.lua
-- 自动生成的玩家初始化配置。自定义代码将被覆盖。

---@class PlayerInitConfig
---@field Data table<string, table>

---@type PlayerInitConfig
local PlayerInitConfig = {Data = {}}

-- --- 自动生成配置开始 ---
PlayerInitConfig.Data = {
    ['玩家初始化'] = {
        ['配置名称'] = '玩家初始化',
        ['描述'] = '新玩家首次进入游戏时的初始化配置',
        ['货币初始化'] = {
            {
                ['货币名称'] = '奖杯',
                ['初始数量'] = 50,
            },
            {
                ['货币名称'] = '金币',
                ['初始数量'] = 5000,
            },
        },
        ['变量初始化'] = {
            {
                ['变量名称'] = '解锁_固定值_重生',
                ['初始值'] = 1,
            },
            {
                ['变量名称'] = '数据_固定值_战力值',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '数据_固定值_历史最大战力值',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '数据_固定值_重生次数',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '加成_百分比_训练加成',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '加成_百分比_速度加成',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '加成_百分比_金币加成',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '加成_百分比_速度加成',
                ['初始值'] = 0,
            },
            {
                ['变量名称'] = '加成_百分比_移动加成',
                ['初始值'] = 0,
            },
        },
        ['指令初始化'] = {
            'pet { "操作类型": "新增", "宠物": "呆萌小幽" }',
            'pet { "操作类型": "新增", "宠物": "呆萌小幽" }',
            'pet { "操作类型": "新增", "宠物": "飘飘小灵" }',
            'wing { "操作类型": "新增", "翅膀": "灵涌幻羽" }',
            'partner { "操作类型": "新增", "伙伴": "熊啾小匠" }',
            'achievement { "操作类型": "解锁天赋", "天赋ID": "重生", "等级": 1 }',
        },
        ['成就初始化'] = {
            {
                ['天赋ID'] = '重生',
                ['初始等级'] = 1,
                ['解锁时间'] = 'now',
            },
        },
    },
}
-- --- 自动生成配置结束 ---

return PlayerInitConfig
